Revit 2024 API
BuiltInFailures.GroupFailures.BadViewForAttachedGroupWarn Property
 Attached groups can only be created for view specific elements belonging to non-3d model views.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId BadViewForAttachedGroupWarn { get; }
Visual Basic
Public Shared ReadOnly Property BadViewForAttachedGroupWarn As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ BadViewForAttachedGroupWarn {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.GroupFailures Class
Autodesk.Revit.DB Namespace